jonacappelle/nRF52-DCU/BLE_Services/ble_tes_c.c
        p_ble_tes_c->peer_thingy_tes_db.config_cccd_handle    = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.config_handle       = BLE_GATT_HANDLE_INVALID;

        p_ble_tes_c->peer_thingy_tes_db.euler_cccd_handle    = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.heading_cccd_handle       = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.adc_cccd_handle       = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.pedometer_cccd_handle            = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.quat_cccd_handle          = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.raw_cccd_handle         = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.rot_cccd_handle         = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.tap_cccd_handle            = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.gravity_cccd_handle            = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.euler_handle                 = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.heading_handle               = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.adc_handle              = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.pedometer_handle         = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.quat_handle            = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.raw_handle            = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.rot_handle                 = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.tap_handle               = BLE_GATT_HANDLE_INVALID;
        p_ble_tes_c->peer_thingy_tes_db.gravity_handle              = BLE_GATT_HANDLE_INVALID;
    }
}


void ble_thingy_tes_on_db_disc_evt(ble_thingy_tes_c_t * p_ble_thingy_tes_c, ble_db_discovery_evt_t const * p_evt)
{

    NRF_LOG_DEBUG("ble_thingy_tes_on_db_disc_evt");

    // Check if the Led Button Service was discovered.
    if (p_evt->evt_type == BLE_DB_DISCOVERY_COMPLETE &&
        p_evt->params.discovered_db.srv_uuid.uuid == THINGY_TES_UUID_SERVICE &&
        p_evt->params.discovered_db.srv_uuid.type == p_ble_thingy_tes_c->uuid_type)
    {
        ble_tes_c_evt_t evt;
        evt.evt_type    = BLE_THINGY_TES_C_EVT_DISCOVERY_COMPLETE;
        evt.conn_handle = p_evt->conn_handle;
        NRF_LOG_DEBUG("tes discover count : %d", p_evt->params.discovered_db.char_count);
        for (uint32_t i = 0; i < p_evt->params.discovered_db.char_count; i++)
        {
            const ble_gatt_db_char_t * p_char = &(p_evt->params.discovered_db.charateristics[i]);
            NRF_LOG_INFO("<i=%d> UUID : %x", i, p_char->characteristic.uuid.uuid);
            switch (p_char->characteristic.uuid.uuid)
            {
                case THINGY_TES_UUID_CONFIG_CHAR:
                    evt.params.peer_db.config_cccd_handle      = p_char->cccd_handle;
                    evt.params.peer_db.config_handle = p_char->characteristic.handle_value;
                    NRF_LOG_INFO("401 evt CONFIG handle = %d", p_char->characteristic.handle_value);
                    break;                    
                case THINGY_TES_UUID_TAP_CHAR:
                    evt.params.peer_db.tap_cccd_handle      = p_char->cccd_handle;
                    evt.params.peer_db.tap_handle = p_char->characteristic.handle_value;
                    NRF_LOG_INFO("402 evt TAP handle = %d", p_char->characteristic.handle_value);
                    break;
                case THINGY_TES_UUID_ADC_CHAR: 
                    evt.params.peer_db.adc_cccd_handle = p_char->cccd_handle;
                    evt.params.peer_db.adc_handle = p_char->characteristic.handle_value;
                    NRF_LOG_INFO("403 evt ADC handle = %d", evt.params.peer_db.adc_handle);
                    break;
                case THINGY_TES_UUID_QUATERNION_CHAR:
                    evt.params.peer_db.quat_cccd_handle = p_char->cccd_handle;
                    evt.params.peer_db.quat_handle = p_char->characteristic.handle_value;
                    NRF_LOG_INFO("404 evt Quaternion handle = %d", evt.params.peer_db.quat_handle);
                case THINGY_TES_UUID_PEDOMETER_CHAR: 
                    evt.params.peer_db.pedometer_cccd_handle = p_char->cccd_handle;
                    evt.params.peer_db.pedometer_handle = p_char->characteristic.handle_value;
                    NRF_LOG_INFO("405 evt step counter handle = %d", evt.params.peer_db.pedometer_handle);
                case THINGY_TES_UUID_RAW_CHAR:
                    evt.params.peer_db.raw_cccd_handle      = p_char->cccd_handle;
                    evt.params.peer_db.raw_handle = p_char->characteristic.handle_value;
                    NRF_LOG_INFO("406 evt raw data handle = %d", evt.params.peer_db.raw_handle);
                    break;
                case THINGY_TES_UUID_EULER_CHAR: 
                    evt.params.peer_db.euler_cccd_handle = p_char->cccd_handle;
                    evt.params.peer_db.euler_handle = p_char->characteristic.handle_value;
                    NRF_LOG_INFO("407 evt euler handle = %d", evt.params.peer_db.euler_handle);
                    break;
                case THINGY_TES_UUID_ROT_MAT_CHAR: 
                    evt.params.peer_db.rot_cccd_handle = p_char->cccd_handle;
                    evt.params.peer_db.rot_handle = p_char->characteristic.handle_value;
                    NRF_LOG_INFO("408 evt rotation matrix handle = %d", evt.params.peer_db.rot_handle);
                case THINGY_TES_UUID_HEADING_CHAR:
                    evt.params.peer_db.heading_cccd_handle = p_char->cccd_handle;
                    evt.params.peer_db.heading_handle = p_char->characteristic.handle_value;
                    NRF_LOG_INFO("409 evt heading handle = %d", evt.params.peer_db.heading_handle);
                case THINGY_TES_UUID_GRAVITY_CHAR: 
                    evt.params.peer_db.gravity_cccd_handle = p_char->cccd_handle;
                    evt.params.peer_db.gravity_handle = p_char->characteristic.handle_value;
                    NRF_LOG_INFO("410 evt gravity handle = %d", evt.params.peer_db.gravity_handle);
                default:
                    break;
            }
        }
        //If the instance has been assigned prior to db_discovery, assign the db_handles
         if (p_ble_thingy_tes_c->conn_handle != BLE_CONN_HANDLE_INVALID)
        {
            NRF_LOG_INFO("TES instance has been initialized prior");
            if (
                (p_ble_thingy_tes_c->peer_thingy_tes_db.config_cccd_handle    = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tes_c->peer_thingy_tes_db.config_handle         = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tes_c->peer_thingy_tes_db.euler_cccd_handle    = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tes_c->peer_thingy_tes_db.euler_handle         = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tes_c->peer_thingy_tes_db.pedometer_cccd_handle = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tes_c->peer_thingy_tes_db.pedometer_handle     = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tes_c->peer_thingy_tes_db.quat_cccd_handle     = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tes_c->peer_thingy_tes_db.quat_handle          = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tes_c->peer_thingy_tes_db.raw_cccd_handle      = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tes_c->peer_thingy_tes_db.raw_handle           = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tes_c->peer_thingy_tes_db.tap_cccd_handle      = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tes_c->peer_thingy_tes_db.tap_handle           = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tes_c->peer_thingy_tes_db.heading_cccd_handle  = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tes_c->peer_thingy_tes_db.heading_handle       = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tes_c->peer_thingy_tes_db.adc_cccd_handle   = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tes_c->peer_thingy_tes_db.adc_handle        = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tes_c->peer_thingy_tes_db.rot_cccd_handle      = BLE_GATT_HANDLE_INVALID)&&
                (p_ble_thingy_tes_c->peer_thingy_tes_db.rot_handle           = BLE_GATT_HANDLE_INVALID))
            {
                p_ble_thingy_tes_c->peer_thingy_tes_db = evt.params.peer_db;
            }
        }
        p_ble_thingy_tes_c->evt_handler(p_ble_thingy_tes_c, &evt);

